package HomeWork;
//1. 定义int类型的数组arr, 存储元素11, 22, 33, 44, 55, 通过for循环, 遍历数组.
/*知识点:
数组概述:数组是用于储存多个同种数据类型的容器.
注意:目前所学的数据类型都可以存储,基础数据类型4类8种,引用数据类型.
     4类8种:
            整型:byte,short,int,long
            浮点型:float,double
            字符型:char
            boolean型:true/false
数组声明格式:
            1.数据类型[] 数组名
            2.数据类型 数组名 []
数组定义格式:
            1. 动态:数据类型[] 数组名=new 数据类型[ 数组长度 ]
            2. 静态:数据类型[] 数组名=new 数据类型[]{ 元素1,元素2,元素3,...}
               语法糖:数据类型[] 数组名={ 元素1,元素2,元素3,...}
数组元素调用格式:数组名[ 索引]
*/
public class zuoye_01 {
    public static void main(String[] args) {
        //语法糖:int [] arr={11,22,33,44,55};同样可以做到数组静态赋值.
        int [] arr=new int[]{11,22,33,44,55};
        //for循环遍历数组元素,注意遍历数组的for循环判断条件根据数组长度来确定.
        //数组元素个数比其对应的索引值要大1,原因是索引从0开始的.
        for (int i = 0; i <arr.length ; i++) {
            System.out.println(arr[i]);
        }


    }
}
